/***************************************************************************** 
Copyright: CodeGeek@Hu         
File name: System.c         
Description: RC522文件
Author: HuJiaBin            
Version:                 
Date:                 
History:        
*****************************************************************************/ 
#include "System.h"

/*##############################################################################################
函数名称: 
功能描述: 延时微妙
输　  入: 
输　  出: 
全局变量:
调用模块:
修订历史: 
##############################################################################################*/
__asm void Delayus(uint32_t nUs,uint8_t nFreq)
{
    ALIGN 
    LSR r1,r1,#2
    MUL r0,r1
    SUB r0,#3
    NOP
    NOP
loop
    SUBS r0,#1
    BNE loop
    NOP
    BX lr
}

/*##############################################################################################
函数名称: 
功能描述: 延时毫秒
输　  入: 
输　  出: 
全局变量:
调用模块:
修订历史: 
##############################################################################################*/
void Delayms(uint32_t nMs,uint8_t nFreq)
{
    uint32_t i;
    
}




